tap "homebrew/cask"
tap "shopify/shopify"
tap "heroku/brew"
tap "homebrew/cask-fonts"

cask_args appdir: "/Applications"

brew "coreutils"
brew "ack"
brew "bat"
brew "htop"
brew "prettyping"
brew "tldr"
brew "git-delta"
brew "ripgrep"
brew "pygitup"
brew "lefthook"
brew "zoxide"
brew "fzf"
brew "themekit"
brew "postgresql@13"
brew "heroku"
brew "gpg" # asdf nodejs plugin dep
brew "gawk" # asdf nodejs plugin dep
brew "openssl" # asdf ruby plugin

cask "iterm2"
cask "dash"
cask "deckset"
cask "spotify"
cask "firefox"
cask "google-chrome"
cask "ngrok"
cask "raycast"

mas "1Password 7", id: 1333542190
mas "Magnent", id: 441258766
mas "Patterns",id: 429449079
mas "Spark", id: 1176895641
mas "HazeOver", id: 430798174
mas "Deliveries", id: 290986013
mas "Bumpr", id: 1166066070
mas "DayOne", id: 1055511498
mas "Boop", id: 1518425043
mas "Reeder", id: 1529448980
mas "Popclip", id: 445189367
mas "1Blocker", id: 1365531024
mas "CodeRunner", id: 955297617
mas "Paprika", id: 1303222628
mas "Pixelmator Pro", id: 1289583905
mas "Tot", id: 1491071483
mas "Microsoft Word", id: 462054704
mas "Microsoft Excel", id: 462058435
mas "Microsoft Powerpoint", id: 462062816
mas "Hand Mirror", id: 1502839586
mas "Slack", id: 803453959
mas "Fantastical", id: 975937182
mas "Cardhop", id: 1290358394
mas "Paste", id: 967805235
mas "Littleipsum", id:405772121

# Safari Extensions
mas "Hugh Nag Blocker", id: 1544743900
mas "Tweaks for Twitter", id: 1567751529
mas "Save to Pocket", id: 1477385213
