tap "shopify/shopify"
tap "heroku/brew"
tap "TomAnthony/brews" # itermocli

cask_args appdir: "/Applications"

#brew "coreutils"
#brew "ack"
#brew "bat"
#brew "htop"
#brew "prettyping"
#brew "tldr"
#brew "git-delta"
#brew "ripgrep"
#brew "zoxide"
#brew "fzf"
#brew "heroku"
#brew "exiftool"
#brew "postgresql@14"
#brew "openssl@3"
#brew "libyaml"
#brew "readline"
#brew "gmp"
#brew "miller"
#brew "universal-ctags"

cask "iterm2"
cask "firefox"
cask "google-chrome"
cask "ngrok"

mas "Patterns",id: 429449079
mas "HazeOver", id: 430798174
mas "Bumpr", id: 1166066070
mas "DayOne", id: 1055511498
mas "Boop", id: 1518425043
mas "Reeder", id: 1529448980
mas "CodeRunner", id: 955297617
mas "Paprika", id: 1303222628
mas "Pixelmator Pro", id: 1289583905
mas "Tot", id: 1491071483
mas "Microsoft Word", id: 462054704
mas "Microsoft Excel", id: 462058435
mas "Slack", id: 803453959
mas "Fantastical", id: 975937182
mas "Paste", id: 967805235
mas "Parcel",id: 639968404
mas "Spark", id: 6445813049
mas "Save to Reader", id: 1640236961
mas "Magnet", id: 441258766
mas "Instapaper", id: 288545208

#brew install font-hack-nerd-font
#brew install --cask alt-tab
